app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "title for new"], ["room_number", 123]]
---
  def create
    @school_class = SchoolClass.create(post_params(:title, :room_number))